Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Accessible units and Type B units shall be provided in nursing homes of Group I-2, Condition 1 occupancies in accordance with Sections 1108.5.2.1 and 1108.5.2.2.
fr_ca: Des logements accessibles et des logements de type B doivent être prévus dans les centres d'hébergement et de soins de longue durée des usages du groupe I-2, condition 1, selon les sections 1108.5.2.1 et 1108.5.2.2.

source: Accessible units shall be dispersed among the various classes of units.
fr_ca: Les unités accessibles doivent être réparties entre les différentes classes d'unités.

source: Accessible units shall be provided in Group I-3 occupancies in accordance with Sections 1108.5.5.1 through 1108.5.5.3.
fr_ca: Des unités accessibles doivent être prévues dans les usages du groupe I-3 selon les sections 1108.5.5.1 à 1108.5.5.3.

source: Accessible units shall comply with Section 1102.
fr_ca: Les logements accessibles doivent être conformes à la section 1102.

source: Accessible units, Type A units and Type B units shall be provided in Group R occupancies in accordance with Sections 1108.6.1 through 1108.6.4.
fr_ca: Des unités accessibles, des unités de type A et des unités de type B doivent être prévues dans les usages du Groupe R selon les sections 1108.6.1 à 1108.6.4.

source: Accessible units, Type A units and Type B units shall be provided in Group R-2 occupancies in accordance with Sections 1108.6.2.1 through 1108.6.2.3.
fr_ca: Des unités accessibles, des unités de type A et des unités de type B doivent être prévues dans les usages du groupe R-2 selon les sections 1108.6.2.1 à 1108.6.2.3.

source: Accessories such as grab bars, towel bars, paper dispensers and soap dishes, provided on or within walls, shall be installed and sealed to protect structural elements from moisture.
fr_ca: Les accessoires tels que les barres d'appui, les porte-serviettes, les distributeurs de papier et les porte-savons, fournis sur ou à l'intérieur des murs, doivent être installés et scellés pour protéger les éléments de structure de l'humidité.

source: Acoustical ceiling systems that are part of fire-resistance-rated construction shall be installed in the same manner used in the assembly tested and shall comply with the provisions of Chapter 7.
fr_ca: Les systèmes de plafond acoustique qui font partie d’une construction ayant un degré de résistance au feu doivent être installés de la même manière que dans l’assemblage soumis à l’essai et doivent être conformes aux dispositions du chapitre 7.

source: Acoustical materials complying with the interior finish requirements of Section 803 shall be installed in accordance with the manufacturer's recommendations and applicable provisions for applying interior finish.
fr_ca: Les matériaux acoustiques conformes aux exigences relatives aux finitions intérieures de la section 803 doivent être installés conformément aux recommandations du fabricant et aux dispositions applicables à la mise en œuvre des finitions intérieures.

source: Activation of the button or switch shall initiate an audible tone within the unit.
fr_ca: L'activation du bouton ou de l'interrupteur doit déclencher une tonalité sonore à l'intérieur du logement.

source: Activation of the fire alarm in Group A occupancies with an occupant load of 1,000 or more shall initiate a signal using an emergency voice/alarm communications system in accordance with Section 907.5.2.2.
fr_ca: L'activation de l'aL’activation de l’alarme d’incendie dans les usages du groupe A ayant une charge d’occupants de 1 000 personnes ou plus doit déclencher un signal au moyen d’un système de communication vocale et d’alarme d’urgence conforme à la section 907.5.2.2.

source: Additionally, the design of personnel hoists shall include provisions for field testing and maintenance that will demonstrate that the hoist device functions in accordance with the design.
fr_ca: De plus, la conception des monte-personnes doit prévoir des dispositions permettant d’effectuer des essais sur place et l’entretien afin de démontrer que l’appareil de levage fonctionne conformément à la conception.

source: Adult changing stations shall comply with Sections 613.2 through 613.4.
fr_ca: Les tables à langer pour adultes doivent être conformes aux sections 613.2 à 613.4.

source: After the building official inspects the building or structure and does not find violations of the provisions of this code or other laws that are enforced by the department, the building official shall issue a certificate of occupancy that contains the following:
fr_ca: Après que le responsable de la construction a inspecté le bâtiment ou la structure et n'a pas constaté de violations des dispositions du présent code ou d'autres lois appliquées par le département, le responsable de la construction doit délivrer un certificat d'occupation qui contient ce qui suit :

source: Air exhaust and intake openings that terminate outdoors shall be protected with corrosion-resistant screens, louvers or grilles having an opening size of not less than 1/4 inch (6 mm) and a maximum opening size of 1/2 inch (13 mm), in any dimension.
fr_ca: Les ouvertures de prise d’air et d’évacuation d’air qui débouchent à l’extérieur doivent être protégées par des moustiquaires, des persiennes ou des grilles résistantes à la corrosion, dont les ouvertures ont une dimension d’au moins 1/4 po (6 mm) et une dimension maximale de 1/2 po (13 mm), dans toute direction.

source: Air gaps shall comply with ASME A112.1.2 or A112.1.3.
fr_ca: Les entrefers doivent être conformes à la norme ASME A112.1.2 ou A112.1.3.

source: Air transfer openings in smoke partitions shall be provided with a smoke damper complying with Section 717.3.2.2.
fr_ca: Les ouvertures de transfert d’air dans les cloisons pare-fumée doivent être munies d’un registre coupe-fumée conforme à la section 717.3.2.2.

source: Aisle accessways for seating at tables shall comply with Section 1030.13.1.
fr_ca: Les accès par les allées pour les sièges aux tables doivent être conformes à la section 1030.13.1.

source: Aisle accessways for seating in rows shall comply with Section 1030.13.2.
fr_ca: Les voies d’accès aux allées pour les sièges disposés en rangées doivent être conformes à la section 1030.13.2.

source: Aisle accessways serving arrangements of seating at tables or counters shall comply with the capacity requirements of Section 1005.1 but shall not have less than 12 inches (305 mm) of width plus 1/2 inch (12.7 mm) of width for each additional 1 foot (305 mm), or fraction thereof, beyond 12 feet (3658 mm) of aisle accessway length measured from the center of the seat farthest from an aisle.
fr_ca: Les voies d’accès aux allées desservant des configurations de sièges à des tables ou à des comptoirs doivent être conformes aux exigences de capacité de la section 1005.1, mais ne doivent pas avoir une largeur inférieure à 12 po (305 mm), plus 1/2 po (12,7 mm) de largeur pour chaque 1 pi (305 mm) supplémentaire, ou fraction de celui-ci, au-delà de 12 pi (3 658 mm) de longueur de la voie d’accès à l’allée, mesurée à partir du centre du siège le plus éloigné d’une allée.

source: Aisle or doorway at both ends of row
fr_ca: Allée ou ouverture de porte aux deux extrémités de la rangée

source: Aisle or doorway at one end of row only
fr_ca: Allée ou ouverture de porte à une seule extrémité de la rangée

source: Aisles and aisle accessways serving a room or space used for assembly purposes shall comply with Section 1030.
fr_ca: Les allées et les voies d’accès aux allées desservant une salle ou un espace utilisé à des fins de rassemblement doivent être conformes à la section 1030.

source: Aisles and aisle accessways serving a smoke-protected assembly seating area shall be provided with a smoke control system complying with Section 909 or natural ventilation designed to maintain the smoke level not less than 6 feet (1829 mm) above the floor of the means of egress.
fr_ca: Les allées et les voies d’accès aux allées desservant une aire de sièges pour assemblées protégée contre la fumée doivent être munies d’un système de contrôle de la fumée conforme à la section 909 ou d’un système de ventilation naturelle conçu pour maintenir le niveau de fumée à au moins 6 pi (1 829 mm) au-dessus du plancher du moyen d’évacuation.

source: Aisles and aisle accessways serving as a portion of the exit access in the means of egress system shall comply with the requirements of this section.
fr_ca: Les allées et les voies d’accès aux allées qui servent de partie de l’accès à l’issue dans le système de moyens d’évacuation doivent être conformes aux exigences de la présente section.

source: Aisles or aisle accessways shall be provided from all occupied portions of the exit access that contain seats, tables, furnishings, displays and similar fixtures or equipment.
fr_ca: Des allées ou des voies d’accès aux allées doivent être prévues à partir de toutes les parties occupées de l’accès à l’issue qui comportent des sièges, des tables, du mobilier, des présentoirs et des installations ou équipements similaires.

source: Aisles that are sloped more than 1 unit vertical in 20 units horizontal (5-percent slope) shall be considered to be a ramped aisle.
fr_ca: Les allées dont la pente est supérieure à 1 unité verticale sur 20 unités horizontales (pente de 5 %) doivent être considérées comme des allées en pente.

source: Aisles with a slope exceeding one unit vertical in eight units horizontal (12.5-percent slope) shall consist of a series of risers and treads that extends across the full width of aisles and complies with Sections 1030.14.2.1 through 1030.14.2.4.
fr_ca: Les allées dont la pente est supérieure à 1 unité verticale sur 8 unités horizontales (pente de 12,5 %) doivent être constituées d’une série de contremarches et de girons s’étendant sur toute la largeur des allées et doivent être conformes aux sections 1030.14.2.1 à 1030.14.2.4.

source: Aisles, stepped aisles and ramped aisles shall be built of materials consistent with the types permitted for the type of construction of the building.
fr_ca: Les allées, les allées à gradins et les allées en rampe doivent être construites avec des matériaux conformes aux types autorisés pour le type de construction du bâtiment.

source: Alcohol and drug centers
fr_ca: Centres de traitement de l’alcoolisme et de la toxicomanie

source: All Group R-2 units on a site shall be considered to determine the total number of units and the required number of Type A units.
fr_ca: Toutes les unités du groupe R-2 sur un site doivent être prises en compte pour déterminer le nombre total d'unités et le nombre requis d'unités de type A.

source: All appliance controls shall comply with Section 1103.9.
fr_ca: Toutes les commandes d'appareils doivent être conformes à la section 1103.9.

source: All appliance controls shall comply with Section 309.
fr_ca: Toutes les commandes d'appareils doivent être conformes à la section 309.

source: All other toilet and bathing facilities shall comply with Section 1102.11.1
fr_ca: Toutes les autres toilettes et salles de bain doivent être conformes à la section 1102.11.1

source: All rooms served by an accessible route shall provide a turning space.
fr_ca: Toutes les pièces desservies par un itinéraire accessible doivent fournir un espace de rotation.

source: All steps on a flight of stairs shall have uniform riser height and uniform tread depth.
fr_ca: Toutes les marches d'une volée de marches doivent avoir une hauteur de contremarche uniforme et une profondeur de marche uniforme.

source: All stories above the lowest two stories shall be separated from the atrium in accordance with the provisions for a shaft in Section 713.4.
fr_ca: Tous les étages situés au-dessus des deux étages les plus bas doivent être séparés de l’atrium conformément aux dispositions applicables aux puits de l’article 713.4.

source: All toilet and bathing facilities shall comply with Section 1103.11.1.
fr_ca: Toutes les toilettes et salles de bain doivent être conformes à la section 1103.11.1.

source: All visible notification appliances provided within the unit for building fire alarm notification shall be activated upon activation of the building fire alarm in the portion of the building containing the unit.
fr_ca: Tous les dispositifs de notification visuelle installés dans le logement pour signaler l’alarme d'incendie du bâtiment doivent être activés dès le déclenchement de l’alarme d'incendie du bâtiment dans la partie du bâtiment où se trouve le logement.

source: All visible notification appliances provided within the unit for smoke detection notification shall be activated upon smoke detection.
fr_ca: Tous les dispositifs de signalisation visible prévus dans le logement pour la signalisation de détection de fumée doivent être activés lors de la détection de fumée.

source: Allowable stresses shall not be exceeded for materials used where a vertical or horizontal force of 250 pounds (1112 N) is applied at any point on the seat, fastener mounting device, or supporting structure.
fr_ca: Les contraintes admissibles ne doivent pas être dépassées pour les matériaux utilisés lorsqu'une force verticale ou horizontale de 250 lb [1112 N] est appliquée en tout point du siège, du dispositif de montage de la fixation ou de la structure de support.

source: Alternate roll-in shower compartments shall have a clear inside dimension of 60 inches (1525 mm) minimum in width, and 36 inches (915 mm) in depth, measured at the center point of opposing sides.
fr_ca: Les compartiments de douche à accès de plain-pied alternatifs doivent avoir des dimensions intérieures libres d'au moins 60 po [1525 mm] en largeur et de 36 po [915 mm] en profondeur, mesurées au point central des côtés opposés.

source: Alternate roll-in-type shower compartments shall comply with Section 608.2.3.
fr_ca: Les cabines de douche de type fauteuil roulant de rechange doivent être conformes à la section 608.2.3.

source: Alternating tread devices.
fr_ca: Dispositifs à marches alternées.

source: Alternative automatic fire-extinguishing systems complying with Section 904 shall be permitted instead of automatic sprinkler protection where recognized by the applicable standard and approved by the fire code official.
fr_ca: Les systèmes d’extinction automatique d’incendie de remplacement conformes à la section 904 peuvent être utilisés à la place d’un système de protection par extincteurs automatiques lorsque la norme applicable les reconnaît et qu’ils sont approuvés par le responsable de la réglementation en matière d’incendie.

source: Alternatively, the impact insulation class of floor-ceiling assemblies shall be established by engineering analysis based on a comparison of floor-ceiling assemblies having impact insulation class ratings as determined by the test procedures in ASTM E492.
fr_ca: Sinon, l’indice d’isolation aux bruits d’impact des ensembles plancher-plafond doit être établi au moyen d’une analyse technique fondée sur une comparaison avec des ensembles plancher-plafond dont les indices d’isolation aux bruits d’impact ont été déterminés conformément aux méthodes d’essai prévues dans la norme ASTM E492.

source: Alternatively, the sound transmission class of walls, partitions and floor-ceiling assemblies shall be established by engineering analysis based on a comparison of walls, partitions and floor-ceiling assemblies having sound transmission class ratings as determined by the test procedures set forth in ASTM E90.
fr_ca: Sinon, l’indice de transmission du son des murs, cloisons et ensembles plancher-plafond doit être établi au moyen d’une analyse technique fondée sur une comparaison avec des murs, cloisons et ensembles plancher-plafond dont les indices de transmission du son ont été déterminés conformément aux méthodes d’essai énoncées dans la norme ASTM E90.

source: Ambient sound levels from sound sources outside and inside the classroom shall be evaluated individually.
fr_ca: Les niveaux sonores ambiants provenant de sources sonores à l'extérieur et à l'intérieur de la salle de classe doivent être évalués individuellement.

source: An L-shaped continuous grab bar of equivalent dimensions and positioning shall be permitted to serve the function of separate vertical and horizontal grab bars.
fr_ca: Une barre d'appui continue en forme de L de dimensions et de positionnement équivalents peut servir de barres d'appui verticales et horizontales séparées.

source: An accessible entrance is not required to areas not required to be accessible.
fr_ca: Une entrée accessible n'est pas exigée pour les zones qui ne doivent pas être accessibles.

source: An accessible entrance is not required to dwelling units and sleeping units that are not required to be Accessible units, Type A units or Type B units.
fr_ca: Une entrée accessible n'est pas exigée pour les logements et les unités de couchage qui ne sont pas tenus d'être des unités accessibles, des unités de type A ou des unités de type B.

source: An accessible entrance is not required to self-service storage facilities that are not required to be accessible.
fr_ca: Une entrée accessible n'est pas exigée pour les installations d'entreposage en libre-service qui ne doivent pas être accessibles.

source: An accessible route between stories is not required where Type B units are exempted by Section 1108.7.
fr_ca: Un itinéraire accessible entre les étages n'est pas requis lorsque les unités de type B sont exemptées par la section 1108.7.

source: An accessible route is not required between accessible buildings, accessible facilities, accessible elements and accessible spaces that have, as the only means of access between them, a vehicular way not providing for pedestrian access.
fr_ca: Un itinéraire accessible n’est pas exigé entre les bâtiments accessibles, les installations accessibles, les éléments accessibles et les espaces accessibles dont le seul moyen d’accès entre eux est une voie de circulation véhiculaire ne permettant pas l’accès aux piétons.

source: An accessible route is not required to stories, mezzanines and occupied roofs that have an aggregate area of not more than 3,000 square feet (278.7 m2) and are located above and below accessible levels.
fr_ca: Un itinéraire accessible n’est pas exigé pour les étages, les mezzanines et les toitures occupées dont la superficie totale ne dépasse pas 3 000 pi2 (278,7 m2) et qui sont situés au-dessus ou au-dessous de niveaux accessibles.

source: An accessible route is not required to unfinished attics and unfinished basements that are part of the unit.
fr_ca: Un itinéraire accessible n'est pas requis pour les greniers non aménagés et les sous-sols non aménagés qui font partie de l'unité.

source: An accessible route shall not be required to freestanding press boxes that are more than 12 feet (3660 mm) above grade provided that the aggregate area of all press boxes for each playing field is not more than 500 square feet (46 m2).
fr_ca: Une voie accessible n’est pas exigée pour les cabines de presse autonomes situées à plus de 12 pi (3 660 mm) au-dessus du niveau du sol, à condition que la superficie totale de toutes les cabines de presse pour chaque terrain de jeu ne soit pas supérieure à 500 pi2 (46 m2).

source: An accessible route shall not be required to press boxes in bleachers that have a single point of entry from the bleachers, provided that the aggregate area of all press boxes for each playing field is not more than 500 square feet (46 m2).
fr_ca: Une voie accessible n’est pas exigée pour les cabines de presse situées dans les gradins qui ne comportent qu’un seul point d’accès depuis les gradins, à condition que la superficie totale de toutes les cabines de presse pour chaque terrain de jeu ne soit pas supérieure à 500 pi2 (46 m2).

source: An accessible route to recreational facilities shall only be required to the extent specified in Section 1111.
fr_ca: Un itinéraire accessible vers les installations de loisirs n'est exigé que dans la mesure spécifiée à la section 1111.

source: An additional fire pump shall not be required for the secondary water supply unless needed to provide the minimum design intake pressure at the suction side of the fire pump supplying the automatic sprinkler system.
fr_ca: Une pompe à incendie supplémentaire n’est pas requise pour l’alimentation en eau secondaire, sauf si elle est nécessaire pour fournir la pression d’aspiration minimale de calcul à l’entrée de la pompe à incendie alimentant le système d'extincteurs automatiques.

source: An additional interior exit stairway shall not be required for other portions of the building where the highest occupiable floor level in those areas is less than 420 feet (128 m) in building height.
fr_ca: Un escalier d’issue intérieur supplémentaire n’est pas exigé pour les autres parties du bâtiment lorsque le niveau du plancher occupable le plus élevé dans ces parties est situé à une hauteur inférieure à 420 pi (128 m).

source: An additional interior exit stairway shall not be required to be installed in buildings having elevators used for occupant self-evacuation in accordance with Section 3008.
fr_ca: Il n’est pas exigé d’installer un escalier d’issue intérieur supplémentaire dans les bâtiments dotés d’ascenseurs utilisés pour l’auto-évacuation des occupants conformément à l’article 3008.

source: An adult changing station and its supporting structure shall not obstruct required clear floor spaces and maneuvering clearances at fixtures, maneuvering clearances at the adult changing stations, maneuvering clearances at doors, or the turning spaces.
fr_ca: Une station à langer pour adultes et sa structure de support ne doivent pas obstruer les surfaces de plancher dégagées requises et les espaces de dégagement au niveau des appareils sanitaires, les espaces de dégagement au niveau des stations à langer pour adultes, les espaces de dégagement au niveau des portes ou les espaces de rotation.

source: An aisle accessway shall be provided on not less than one side of each element within the merchandise pad.
fr_ca: Une voie d'accès à l'allée doit être prévue sur au moins un côté de chaque élément dans la zone de marchandises.

source: An application for a permit for any proposed work shall be deemed to have been abandoned 180 days after the date of filing, unless such application has been pursued in good faith or a permit has been issued; except that the building official is authorized to grant one or more extensions of time for additional periods not exceeding 90 days each.
fr_ca: Une demande de permis visant des travaux proposés est réputée abandonnée 180 jours après sa date de dépôt, à moins que la demande n’ait fait l’objet de démarches de bonne foi ou qu’un permis n’ait été délivré; toutefois, le responsable de la construction est autorisé à accorder une ou plusieurs prolongations, pour des périodes supplémentaires ne dépassant pas 90 jours chacune.

source: An approved automatic sprinkler system shall be installed throughout the entire building.
fr_ca: Un système d'extincteurs automatiques approuvé doit être installé dans l'ensemble du bâtiment.

source: An approved automatic sprinkler system shall be provided throughout buildings used for the storage of motor vehicles in a mechanical-access enclosed parking garage.
fr_ca: Un système d’extincteurs automatiques approuvé doit être prévu dans tous les bâtiments utilisés pour l’entreposage de véhicules automobiles dans un garage de stationnement fermé à accès mécanique.
